### Data Cleaning and Preparation

In [1]:
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.random.seed(12345)

In [3]:
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

### Handling Missing Data

In [4]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [7]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [8]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [10]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [11]:
data.isnull()

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [12]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
[NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data.notnull()

       0      1      2
0   True   True   True
1   True  False  False
2  False  False  False
3  False   True   True

In [19]:
cleaned1 = data[data.notnull()]
cleaned1

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [22]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
data.dropna(how='all') ## If all the values in the data frame rows are null then only it will delete the row.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [23]:
data[4] = NA # It going to add one more column with provided value to all the rows.
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [24]:
data.dropna(axis=1, how='all') ## "Axis 1" means column and "Axis 0" means row. So if all the column values are null then only delete the column.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [41]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772  0.000940  1.343810
3 -0.713544 -0.831154 -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [42]:
df.iloc[:4, 1] = NA
df

          0         1         2
0  0.476985       NaN -1.021228
1 -0.577087       NaN  0.302614
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [43]:
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.476985       NaN       NaN
1 -0.577087       NaN       NaN
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [44]:
df.dropna()

          0         1         2
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [45]:
df.dropna(thresh=2)

          0         1         2
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

### Filling In Missing Data

In [46]:
df

          0         1         2
0  0.476985       NaN       NaN
1 -0.577087       NaN       NaN
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [47]:
df.fillna(0)

          0         1         2
0  0.476985  0.000000  0.000000
1 -0.577087  0.000000  0.000000
2  0.523772  0.000000  1.343810
3 -0.713544  0.000000 -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [48]:
print(df)
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.476985       NaN       NaN
1 -0.577087       NaN       NaN
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

          0         1         2
0  0.476985  0.500000  0.000000
1 -0.577087  0.500000  0.000000
2  0.523772  0.500000  1.343810
3 -0.713544  0.500000 -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [49]:
print('Data Frame:\n',df)
_ = df.fillna(0, inplace=True)
df

Data Frame:
           0         1         2
0  0.476985       NaN       NaN
1 -0.577087       NaN       NaN
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

          0         1         2
0  0.476985  0.000000  0.000000
1 -0.577087  0.000000  0.000000
2  0.523772  0.000000  1.343810
3 -0.713544  0.000000 -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [50]:
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0 -1.541996 -0.970736 -1.307030
1  0.286350  0.377984 -0.753887
2  0.331286  1.349742  0.069877
3  0.246674 -0.011862  1.004812
4  1.327195 -0.919262 -1.549106
5  0.022185  0.758363 -0.660524

In [51]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -1.541996 -0.970736 -1.307030
1  0.286350  0.377984 -0.753887
2  0.331286       NaN  0.069877
3  0.246674       NaN  1.004812
4  1.327195       NaN       NaN
5  0.022185       NaN       NaN

In [52]:
df.fillna(method='ffill')

          0         1         2
0 -1.541996 -0.970736 -1.307030
1  0.286350  0.377984 -0.753887
2  0.331286  0.377984  0.069877
3  0.246674  0.377984  1.004812
4  1.327195  0.377984  1.004812
5  0.022185  0.377984  1.004812

In [53]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.541996 -0.970736 -1.307030
1  0.286350  0.377984 -0.753887
2  0.331286  0.377984  0.069877
3  0.246674  0.377984  1.004812
4  1.327195       NaN  1.004812
5  0.022185       NaN  1.004812

In [54]:
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [55]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

### Removing Duplicates

In [56]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [57]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [58]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [59]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [60]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [61]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [62]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Lambda Function

In [63]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
'Pastrami', 'corned beef', 'Bacon',
'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [65]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [66]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [67]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [68]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [69]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### Replacing Values inplace of missing values

In [70]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [71]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [72]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [73]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [74]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [75]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [76]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [79]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=['Ohio', 'Colorado', 'New York'],
columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [82]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [83]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [84]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [85]:
data.rename(index={'OHIO': 'INDIANA'},
columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [86]:
print(data)
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [87]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### binning or bucketizing for continuous variables

In [95]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [96]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [97]:
print('Codes:',cats.codes)
print('Categories:',cats.categories)
print('Value Counts:',pd.value_counts(cats))

Codes: [0 0 0 1 0 0 2 1 3 2 2 1]
Categories: IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')
Value Counts: (18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [98]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [99]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [101]:
data = np.random.rand(20)
data

array([0.8981, 0.0427, 0.1958, 0.2945, 0.627 , 0.0862, 0.1429, 0.5158,
       0.6893, 0.8566, 0.6474, 0.5816, 0.7111, 0.2524, 0.9002, 0.4423,
       0.0205, 0.9597, 0.6522, 0.5132])

In [102]:
pd.cut(data, 4, precision=2)

[(0.72, 0.96], (0.02, 0.26], (0.02, 0.26], (0.26, 0.49], (0.49, 0.72], ..., (0.26, 0.49], (0.02, 0.26], (0.72, 0.96], (0.49, 0.72], (0.49, 0.72]]
Length: 20
Categories (4, interval[float64, right]): [(0.02, 0.26] < (0.26, 0.49] < (0.49, 0.72] < (0.72, 0.96]]

In [105]:
data = np.random.randn(1000) # Normally distributed
print('Data:\n',data)
cats = pd.qcut(data, 4) # Cut into quartiles
print('Cats:\n',cats)
print('Value Counts: \n',pd.value_counts(cats))

Data:
 [ 1.8325  1.6587  0.4541 -0.195  -0.9769 -0.2961 -0.5813 -0.0199 -0.0381
  1.1926 -1.0981 -0.6329  0.8024 -0.0651 -0.1542  0.9219  1.9565  0.3797
  0.2708 -1.1271  0.526   0.5903  1.1391  0.0549  0.5501  0.1604  0.1603
 -0.7129 -0.3083  0.3176  2.4588 -0.8788  0.8507  0.2059  0.303  -0.226
  1.9055  1.4967  0.134  -0.5037 -0.611   0.046   1.0062  0.9306 -0.1703
 -0.5956 -0.4638 -1.2542 -1.0777 -0.6085  0.11   -0.0765 -0.469   0.2668
 -1.8483 -1.0802  0.0029 -0.6301 -1.0957  0.5798  0.3322 -1.2727 -0.6733
 -0.511  -1.4893  0.6677 -1.8229  0.8412  0.3983 -0.9978  0.8727 -0.5599
  0.3308 -1.0184 -0.3428 -0.3207 -0.4087 -2.4316  0.5338 -0.5062 -0.4676
 -0.8043 -1.6237 -0.1057 -0.5462  2.0131 -0.5437 -0.6541 -0.4964 -0.0764
  1.2087  1.0529 -2.0771  0.1776 -1.6798  0.5    -1.3829  0.1638 -1.2652
 -0.2843 -0.3729  1.2452 -2.2371 -0.5708  1.3712  1.162   0.6065  0.2645
  0.3517  0.4824 -0.0841 -0.4978 -0.7208 -0.1651 -0.4034 -0.7121  0.1251
 -0.1136 -1.3531 -0.831   0.3652 -0.5447  0.9779 -0.2564  0.5108  0.7203
  0.3809  1.0034 -2.3156  0.4572 -0.0259 -3.3993 -0.9747 -0.6853 -0.6459
 -0.0308 -1.0115 -0.1227 -0.4385  1.2136 -0.638  -0.3739 -0.0534 -0.1046
  0.3938 -0.132  -0.5292  0.3035 -0.8896 -0.1733  0.6433 -1.254   0.1172
  0.8665  1.0795 -0.3975  1.4875  0.558   0.6144  0.428  -0.272   0.7388
 -0.5081  1.3153  0.4459  0.5732  0.1933  0.4429  1.2796  0.575   0.4339
 -0.7658 -1.237  -0.5367  1.8545 -0.92   -0.1082  0.1525  0.9435 -1.0953
 -0.144   1.9562 -0.2912  0.1048  0.1396 -0.2841 -0.7082  2.4632  0.2175
 -0.0106 -0.006   0.4901 -0.2772 -0.7072 -0.5601  2.7355  0.9273  1.5139
  0.5386  1.2738  0.6679 -0.9692  1.6761 -0.8176  0.0502  1.9513  3.2604
  0.9633  1.2012 -1.852   2.4068  0.8412 -0.7492 -2.9897 -1.2953 -1.6902
  2.6284 -0.4246 -1.3144 -0.0106 -0.4972  0.964  -0.7058  1.6857 -0.9278
 -0.4048 -0.1374 -0.422  -2.0417 -0.3186  0.441  -1.0246  0.5611 -0.0615
  1.4412  0.8656 -0.442   0.5079 -1.1221 -0.5164  0.7184 -1.9298  2.5279
  0.7314  0.7442 -1.8012  0.3999 -0.377  -1.7812 -0.2722 -1.0202  0.4028
  1.5548  0.7562  1.3569 -1.1654 -1.1356 -1.4749  0.6183  0.4423 -1.327
  0.927  -0.1156  0.9435 -0.3494  0.5304 -0.5087  0.2306 -0.0656 -0.2487
 -0.5871 -1.0223  1.0607  0.9548 -0.5118 -1.3877  0.7679 -1.1645  1.5271
  0.2875  0.7154 -0.3458  0.4709 -1.1215 -1.5444  1.7205 -0.1717 -0.8278
  0.3705 -0.6742 -1.7123 -0.7382  0.3918  1.7634 -0.0546 -0.6565 -1.5501
 -0.0443  0.6815 -0.9537 -1.857   0.4495 -0.0617  1.2339  0.7058 -1.3091
 -1.5374  0.5316  2.0476  0.4467 -0.2236  0.0928  0.7161  0.6572 -0.0667
  0.8386 -0.1174 -0.5178 -0.1167  2.3896 -0.9325 -0.2293 -1.1403  0.4399
 -0.8238 -0.5209  0.3503  0.2044  0.1334  0.3279  0.0722  0.1317 -1.2975
  0.9977  0.871  -0.9913  0.1517  1.2662 -0.2025  0.0507  0.6399  0.5976
 -0.7972  0.4729  0.5224 -0.5463 -0.7335  1.3027  0.0222  0.3643 -0.9228
  0.3127 -1.1285 -0.3335 -0.5146 -0.5598 -0.7834 -1.7977 -0.1727  0.6802
  1.6076  0.2004 -0.8341 -0.303   1.6633 -0.9962  1.5218  0.2442  0.4233
 -0.654   2.0892 -0.0602 -0.1679  0.6316 -1.5943 -1.5199  1.1088  1.2559
 -0.0243 -2.0479 -0.2727 -1.6926  1.4238 -0.4079  0.7563 -1.2886  0.8675
  0.5753  0.3042  1.8146  1.6349 -1.6457 -0.4072 -0.2528 -0.8946  0.9558
 -1.654  -0.2625 -0.9761 -1.4934  1.1679  0.969  -2.5365  0.3628 -1.1961
  1.637   0.2513  1.6246 -0.2406  0.1631 -0.5867  0.4146  0.4272  1.1726
 -0.3516  1.4546  2.0433 -1.7493 -0.3872 -0.2081 -1.222  -0.0675  0.229
 -0.5762  0.8169 -0.7722 -1.3336 -0.3091  0.0286  1.1296 -0.3742 -0.0114
  0.2729 -0.6015  0.5743 -0.1941  0.2022 -0.5051  2.9544 -2.6302 -0.3525
 -0.4778  0.1616  1.6868  0.822  -0.6674  0.4685  0.9663  0.5204 -0.1189
  0.0335 -0.2256  0.1057  0.3032 -0.1957  0.7649 -0.4498  1.0381  1.5732
  1.2829  0.281  -0.892   0.5176 -0.0079 -1.6388  1.4012  1.7585  0.6289
 -0.4238  0.7897  0.9376 -2.2533 -1.7729 -0.8964  0.6773  0.0365  0.0871
 -0.0467  0.9272  0.4823 -0.8671  0.4938 -0.1554  1.3973  1.5071 -1.1794
  0.4432  1.3957 -0.5297  0.7874  0.2488  0.7432  1.2677  1.3024 -0.2722
 -0.0515 -0.4677 -1.0408  0.4264  0.3129 -1.1157  1.2343 -1.8931 -1.6616
 -0.0055  1.1022  1.0135  2.2688  0.1463  0.5084 -0.1967 -3.7454 -1.5201
 -0.3468 -0.6969  1.3073 -0.6836  1.098  -0.3766  1.1881  1.7934  1.2979
  0.8177 -0.3343 -1.5651  1.4232  0.8408 -1.4781  0.8435 -0.3386  0.8986
  0.3008 -1.4509  0.4876  0.5528  0.652  -1.7465  0.836  -0.5117 -0.1622
  1.1641 -0.6731  1.4592  2.377  -0.951  -0.2662 -0.6097 -0.2688  0.1956
  0.8598 -0.2632  1.1414 -0.1019 -0.0767  0.1208  1.0766  0.4342  0.0564
 -0.3789  0.0478  0.3416  1.5679 -0.0476 -0.8218 -0.1793 -0.1667  0.3332
 -0.5446 -0.6536 -2.311   1.6123 -0.8066  0.5579  0.5802 -1.2058  0.0266
  0.5027  1.5432  0.8876 -2.0435 -0.8092 -0.4357  2.1848 -1.0784  2.2133
  0.4472 -0.0994 -0.574   1.7278 -0.3516  0.6138 -0.1908 -0.9804 -1.7316
  0.1836 -0.3849 -1.2063 -1.9204  0.0205 -1.35    0.4111  1.5928  1.9091
  1.7552 -0.2718  1.29   -0.2322  0.4287 -0.723   0.3907  1.6597  0.8739
 -1.1802 -0.2089 -0.5497 -1.2529 -1.2768  1.8812  1.1082 -1.752  -0.9739
  0.9087 -0.5092 -1.0234 -0.4123 -1.073  -0.6014  0.2222  0.9494  0.7042
 -1.359   1.1485 -0.1619 -0.6274  0.6176 -1.449   1.0111 -0.5998  0.8628
  1.6618 -0.8507  0.2078 -0.1272  0.2795  0.7187 -0.5316 -0.8802 -0.3769
 -1.1577 -0.1256 -1.4022  2.4247 -1.956  -0.8973  0.9896  1.0965  0.4543
 -1.0183  2.2382  0.4063  1.296   0.469  -2.1953 -1.2217  0.9634  0.1073
 -1.2555 -0.5347  0.9595 -0.8072 -0.0054  0.1752  1.8402 -1.8222 -0.3747
  1.7656 -0.2146 -0.3093  0.3591  0.7872 -0.2997 -0.5019  0.2388  0.1882
 -1.1183  0.3862  0.2241 -1.3592  1.0939 -1.2543 -2.9251  0.6546  1.2272
  0.4012 -0.4088  2.1526 -1.9719 -0.5828 -0.683  -0.2142 -0.6704  0.0963
 -0.8619  1.1201  1.4214 -0.0795  0.5991 -0.5809  1.6361  1.8127 -0.7614
 -0.5681  0.3945  1.0697  0.9528 -0.5375  1.321   0.1533 -2.0842  0.1775
  0.1192  0.7482  0.4877 -1.6559  2.1355 -0.7223  1.0592  1.2325  0.1759
 -0.5501  1.2342 -0.2356  1.1323 -0.2282 -1.4083 -0.0062 -0.5584 -0.4583
 -1.9447  1.6708 -1.9162  0.1282 -0.8238  0.8177  0.3812  0.1681 -0.221
 -1.3544  0.644  -0.2013  1.0191  0.212  -0.3712  0.846  -0.3233 -0.1384
  0.7218  0.5017  1.0865 -0.1528  1.3449 -0.4041 -0.1385 -0.4777 -0.7957
  0.0069 -0.1722 -0.4357 -1.3787 -0.2899  0.239   1.6094 -0.2839 -1.3238
  0.3432  2.0943  0.1123 -0.268   0.7837  0.409  -0.1176  0.2829 -0.1042
 -0.4509  0.3962  1.9853 -0.738  -1.4309  0.4647  2.0743  1.046   1.3969
 -1.2672  1.5075 -2.0641  0.3617 -1.2307 -0.2211  1.2278  1.3877 -0.345
  0.4469  0.2731 -0.1495 -0.7022  1.5314 -0.2457  0.9246 -0.9957 -0.1472
  0.8915 -1.1797  1.1074  0.6638 -0.7403  0.4263 -1.2763  0.6274 -0.2437
  0.3214  1.018   0.4189 -0.7654 -0.7536 -0.0396  0.1668  1.5006  0.258
 -0.1295 -0.3282  0.6701 -0.2938  0.5256 -0.9034  0.1842 -1.0262  0.4075
  0.8121  0.6663  0.5981  0.3843 -0.0863 -1.4421  0.4001  0.222  -0.1331
  0.3967  1.1046 -0.5017 -0.4383  0.4993 -0.2648 -0.3263 -1.1431 -0.7116
 -0.6992 -0.0001  0.8264  0.719   0.4063  0.6534 -1.1119  1.5482  2.2425
 -1.048   0.697  -1.4305  1.0088  0.3278  1.1514  0.0012  1.0579 -1.6334
  0.4518 -0.4188 -1.8258  0.6772 -0.082   1.5614  0.946  -0.593   0.5256
 -1.9649 -0.0327  1.2749  0.0123 -0.2757 -1.9638 -1.7905  0.6318 -1.4481
  1.8382  0.3013  2.1044 -0.8191  0.9479 -1.0338  1.5381 -1.8421 -0.177
 -0.1191  0.6511  1.2695 -1.3415 -0.2933 -0.2425 -3.057   1.9184 -0.5788
  1.8474  0.4537 -0.3025  1.4026  1.2124 -1.6135 -0.574   0.4249  1.2575
 -1.0653  0.2764  1.6801 -0.6793 -0.1297 -1.9309 -0.6076 -0.1953 -2.0774
  0.4226  2.0016  1.3859 -1.1047  0.6771  0.5602 -0.8154  1.0049  0.3618
 -0.3405  0.4624 -0.8668  0.6533 -1.9564 -0.1285 -0.6955 -1.2518 -0.1501
  0.2147 -1.9501 -1.3387  0.3712  1.4288 -0.5928 -0.3124  0.0485  0.136
 -0.4381 -0.1515  0.4016 -2.2235 -0.5747  0.7862 -1.3938  0.3593  1.1709
  0.6787 -0.1259  0.1506 -0.8845 -0.6205  0.2273  0.9223 -2.1535 -0.3658
 -0.3758  0.3299  0.982   1.1059 -1.6137  1.5616  0.4065  0.3592 -0.6144
 -1.6917  0.7587 -0.6823 -1.0385  0.6351 -0.6    -0.1591 -0.4176  1.1415
 -2.043   0.125   0.2036 -0.8847 -0.0269  0.4418  1.004   0.6828  0.326
  0.4254]
Cats:
 [(0.681, 3.26], (0.681, 3.26], (-0.00615, 0.681], (-0.609, -0.00615], (-3.746, -0.609], ..., (-0.00615, 0.681], (0.681, 3.26], (0.681, 3.26], (-0.00615, 0.681], (-0.00615, 0.681]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.746, -0.609] < (-0.609, -0.00615] < (-0.00615, 0.681] < (0.681, 3.26]]
Value Counts:
 (-3.746, -0.609]      250
(-0.609, -0.00615]    250
(-0.00615, 0.681]     250
(0.681, 3.26]         250
dtype: int64

In [106]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(1.316, 3.26], (1.316, 3.26], (-0.00615, 1.316], (-1.299, -0.00615], (-1.299, -0.00615], ..., (-0.00615, 1.316], (-0.00615, 1.316], (-0.00615, 1.316], (-0.00615, 1.316], (-0.00615, 1.316]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.746, -1.299] < (-1.299, -0.00615] < (-0.00615, 1.316] < (1.316, 3.26]]

### filter out the outliers

In [108]:
data = pd.DataFrame(np.random.randn(1000, 4))
data

            0         1         2         3
0    0.546590 -0.998061  0.672712 -1.356067
1   -1.409855 -0.439407  0.571900 -0.549629
2    0.246866  0.300920 -0.217146 -0.274138
3    1.188742 -3.183867  1.050471 -1.042736
4    1.680374 -0.720992 -1.405314  0.507113
..        ...       ...       ...       ...
995 -0.716065  0.022869 -0.133249 -0.116824
996  0.035033 -1.792674 -1.829402 -0.148488
997  0.049953 -1.328991 -0.450672 -1.022412
998 -1.165582 -0.931775  0.049353  0.530328
999  1.018280  0.193930  0.876707  0.283458

[1000 rows x 4 columns]

In [109]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.057988     0.007769    -0.009238    -0.050309
std       1.005670     1.021993     1.000309     0.988153
min      -3.530912    -3.183867    -3.481593    -3.194414
25%      -0.750710    -0.686126    -0.692422    -0.752792
50%      -0.031436     0.003852     0.025105    -0.041676
75%       0.618398     0.700698     0.693113     0.613627
max       2.916153     3.189940     2.961194     3.023720

In [110]:
col = data[2]
col # Column 3 valules

0      0.672712
1      0.571900
2     -0.217146
3      1.050471
4     -1.405314
         ...
995   -0.133249
996   -1.829402
997   -0.450672
998    0.049353
999    0.876707
Name: 2, Length: 1000, dtype: float64

In [111]:
col[np.abs(col) > 3] # We are filtering the data based on the absolue the values greater the 3.

274   -3.481593
669   -3.170292
Name: 2, dtype: float64

In [113]:
np.abs(data)

            0         1         2         3
0    0.546590  0.998061  0.672712  1.356067
1    1.409855  0.439407  0.571900  0.549629
2    0.246866  0.300920  0.217146  0.274138
3    1.188742  3.183867  1.050471  1.042736
4    1.680374  0.720992  1.405314  0.507113
..        ...       ...       ...       ...
995  0.716065  0.022869  0.133249  0.116824
996  0.035033  1.792674  1.829402  0.148488
997  0.049953  1.328991  0.450672  1.022412
998  1.165582  0.931775  0.049353  0.530328
999  1.018280  0.193930  0.876707  0.283458

[1000 rows x 4 columns]

In [114]:
(np.abs(data) > 3)

         0      1      2      3
0    False  False  False  False
1    False  False  False  False
2    False  False  False  False
3    False   True  False  False
4    False  False  False  False
..     ...    ...    ...    ...
995  False  False  False  False
996  False  False  False  False
997  False  False  False  False
998  False  False  False  False
999  False  False  False  False

[1000 rows x 4 columns]

In [115]:
(np.abs(data) > 3).any(1)

0      False
1      False
2      False
3       True
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [112]:
data[(np.abs(data) > 3).any(1)] # any column value is true then it will return the whole row values.

            0         1         2         3
3    1.188742 -3.183867  1.050471 -1.042736
50  -2.214074 -3.140963 -1.509976 -0.389818
215 -0.088202  1.090038 -0.848098 -3.194414
245  0.474358  0.003349 -0.011807  3.023720
274  2.368010  0.452649 -3.481593  0.789944
443  0.164293  3.082067 -0.516982  0.251909
471 -0.843849  3.189940  0.070978  0.516982
635  0.623798 -0.436479  0.901529 -3.044612
669  0.617561 -1.148738 -3.170292 -1.017073
825  0.813014 -1.202724 -0.286215 -3.105636
837  0.123291 -3.024110 -1.168413 -0.888664
898 -3.530912 -0.576175 -0.750648  0.025443

In [117]:
np.sign(data)  * 3

       0    1    2    3
0    1.0 -1.0  1.0 -1.0
1   -1.0 -1.0  1.0 -1.0
2    1.0  1.0 -1.0 -1.0
3    1.0 -1.0  1.0 -1.0
4    1.0 -1.0 -1.0  1.0
..   ...  ...  ...  ...
995 -1.0  1.0 -1.0 -1.0
996  1.0 -1.0 -1.0 -1.0
997  1.0 -1.0 -1.0 -1.0
998 -1.0 -1.0  1.0  1.0
999  1.0  1.0  1.0  1.0

[1000 rows x 4 columns]

In [119]:
data[np.abs(data) > 3] = np.sign(data) * 3 # Removing the decemal value of the number.
data

            0         1         2         3
0    0.546590 -0.998061  0.672712 -1.356067
1   -1.409855 -0.439407  0.571900 -0.549629
2    0.246866  0.300920 -0.217146 -0.274138
3    1.188742 -3.000000  1.050471 -1.042736
4    1.680374 -0.720992 -1.405314  0.507113
..        ...       ...       ...       ...
995 -0.716065  0.022869 -0.133249 -0.116824
996  0.035033 -1.792674 -1.829402 -0.148488
997  0.049953 -1.328991 -0.450672 -1.022412
998 -1.165582 -0.931775  0.049353  0.530328
999  1.018280  0.193930  0.876707  0.283458

[1000 rows x 4 columns]

In [120]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.057457     0.007846    -0.008586    -0.049988
std       1.003974     1.020119     0.998225     0.987023
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.750710    -0.686126    -0.692422    -0.752792
50%      -0.031436     0.003852     0.025105    -0.041676
75%       0.618398     0.700698     0.693113     0.613627
max       2.916153     3.000000     2.961194     3.000000

In [121]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0 -1.0
1 -1.0 -1.0  1.0 -1.0
2  1.0  1.0 -1.0 -1.0
3  1.0 -1.0  1.0 -1.0
4  1.0 -1.0 -1.0  1.0

In [122]:
#reshaping data
import numpy as np
import pandas as pd
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

In [123]:
data = pd.Series(np.random.randn(9),
index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
[1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1   -0.204708
   2    0.478943
   3   -0.519439
b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
d  2    0.281746
   3    0.769023
dtype: float64

In [124]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [126]:
data['b']

1   -0.555730
3    1.965781
dtype: float64

In [127]:
data['b':'c']

b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
dtype: float64

In [128]:
data

a  1   -0.204708
   2    0.478943
   3   -0.519439
b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
d  2    0.281746
   3    0.769023
dtype: float64

In [129]:
data.loc[['b', 'd']]

b  1   -0.555730
   3    1.965781
d  2    0.281746
   3    0.769023
dtype: float64

In [130]:
data.loc[:, 2]

a    0.478943
c    0.092908
d    0.281746
dtype: float64

In [131]:
data

a  1   -0.204708
   2    0.478943
   3   -0.519439
b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
d  2    0.281746
   3    0.769023
dtype: float64

In [132]:
data.unstack()

          1         2         3
a -0.204708  0.478943 -0.519439
b -0.555730       NaN  1.965781
c  1.393406  0.092908       NaN
d       NaN  0.281746  0.769023

In [133]:
data.unstack().stack()

a  1   -0.204708
   2    0.478943
   3   -0.519439
b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
d  2    0.281746
   3    0.769023
dtype: float64

In [134]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
columns=[['Ohio', 'Ohio', 'Colorado'],
['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [135]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [136]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [137]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [138]:
frame.sort_index(level=1)
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11